In [1]:
#1
import pandas as pd
x = pd.Series(['Goutham', 'S', 'Kunnel'])
print(x)

0    Goutham
1          S
2     Kunnel
dtype: object

In [11]:
#2
from datetime import timedelta, date

def daterange(date1, date2):
    for n in range(int ((date2 - date1).days)+1):
        yield date1 + timedelta(n)

start_dt = date(2021, 5, 1)
end_dt = date(2021, 5, 12)

dates= []
for dt in daterange(start_dt, end_dt):
    dates.append(dt.strftime("%Y-%m-%d"))
    
print(pd.Series(dates))

0     2021-05-01
1     2021-05-02
2     2021-05-03
3     2021-05-04
4     2021-05-05
5     2021-05-06
6     2021-05-07
7     2021-05-08
8     2021-05-09
9     2021-05-10
10    2021-05-11
11    2021-05-12
dtype: object

In [12]:
#3
details = {	'Name' : ['Ankit', 'Aishwarya', 'Shaurya', 'Shivangi'],
           'Age' : [23, 21, 22, 21],
           'University' : ['BHU', 'JNU', 'DU', 'BHU'],}
df = pd.DataFrame(details)

df

        Name  Age University
0      Ankit   23        BHU
1  Aishwarya   21        JNU
2    Shaurya   22         DU
3   Shivangi   21        BHU

In [15]:
#4
lst = [['Goutham', 22], ['Gokul', 24],
	['Elton', 23], ['Vishnu', 22]]
df = pd.DataFrame(lst, columns =['Name', 'Age'])
df

      Name  Age
0  Goutham   22
1    Gokul   24
2    Elton   23
3   Vishnu   22

In [29]:
#5
df = pd.read_csv("EX4_5.csv", names=["Name", "Mark", "Department"])
df

      Name  Mark Department
0  Goutham    22        MCA
1    Gokul    24        MCA
2    Elton    23        MCA
3   Vishnu    22        MCA

In [34]:
#6
df = pd.DataFrame({'Name': ['Raj', 'Akhil', 'Sonum', 'Tilak', 'Divya', 'Megha'],
                   'Age': [20, 22, 21, 19, 17, 23],
                   'Rank': [1, 8, 6, 9, 4, 2]})
print('DATAFRAME\n')
print(df)
print('\nSORTED DATAFRAME')
df.sort_values(by=['Rank'], ascending=True)

DATAFRAME

    Name  Age  Rank
0    Raj   20     1
1  Akhil   22     8
2  Sonum   21     6
3  Tilak   19     9
4  Divya   17     4
5  Megha   23     2

SORTED DATAFRAME

    Name  Age  Rank
0    Raj   20     1
5  Megha   23     2
4  Divya   17     4
2  Sonum   21     6
1  Akhil   22     8
3  Tilak   19     9

In [ ]:
#7